**About Book Crossing Dataset**<br>

This dataset has been compiled by Cai-Nicolas Ziegler in 2004, and it comprises of three tables for users, books and ratings. Explicit ratings are expressed on a scale from 1-10 (higher values denoting higher appreciation) and implicit rating is expressed by 0.

Reference: http://www2.informatik.uni-freiburg.de/~cziegler/BX/

**Objective**

This project entails building a Book Recommender System for users based on user-based and item-based collaborative filtering approaches.

In [3]:
import numpy as np 
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

#### Execute the below cell to load the datasets

In [4]:
#Loading data
books = pd.read_csv("books.csv", sep=";", error_bad_lines=False, encoding="latin-1")
books.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']

users = pd.read_csv('users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']

ratings = pd.read_csv('ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
b'Skipping line 421542: expected 3 fields, saw 4\n'
b'Skipping line 539585: expected 3 fields, saw 4\n'

### Check no.of records and features given in each dataset

In [5]:
books.shape

(271360, 8)

In [6]:
users.shape

(691122, 3)

In [7]:
ratings.shape

(1149780, 3)

In [8]:
books.dtypes

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication    object
publisher            object
imageUrlS            object
imageUrlM            object
imageUrlL            object
dtype: object

In [9]:
users.dtypes

userID       object
Location     object
Age         float64
dtype: object

In [10]:
ratings.dtypes

userID         int64
ISBN          object
bookRating     int64
dtype: object

## Exploring books dataset

In [11]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,imageUrlS,imageUrlM,imageUrlL
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

### Drop last three columns containing image URLs which will not be required for analysis

In [12]:
books.drop(labels=['imageUrlS','imageUrlM','imageUrlL'],axis=1,inplace=True)

In [13]:
books.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

**yearOfPublication**

### Check unique values of yearOfPublication

In [14]:
books.yearOfPublication.value_counts()

2002         13903
2001         13715
1999         13414
2000         13373
1998         12116
2003         11610
1997         11494
1996         10687
1995         10259
1994          8857
1993          7920
1992          7390
1991          6926
1990          6394
1989          5825
1988          5545
1987          4761
2004          4629
1986          4258
1999          4017
1985          3912
2000          3859
2002          3724
1998          3650
2001          3644
1984          3631
0             3570
1997          3396
1996          3343
1983          3297
             ...
1904             1
2037             1
1900             1
1931             1
1917             1
1806             1
2008             1
Gallimard        1
1378             1
2024             1
1376             1
1914             1
1924             1
1919             1
2012             1
2038             1
2026             1
2021             1
2011             1
1934             1
1944             1
1938             1
1930             1
2011             1
1927             1
1927             1
1926             1
2020             1
1924             1
1926             1
Name: yearOfPublication, Length: 202, dtype: int64

As it can be seen from above that there are some incorrect entries in this field. It looks like Publisher names 'DK Publishing Inc' and 'Gallimard' have been incorrectly loaded as yearOfPublication in dataset due to some errors in csv file.


Also some of the entries are strings and same years have been entered as numbers in some places. We will try to fix these things in the coming questions.

### Check the rows having 'DK Publishing Inc' as yearOfPublication

In [15]:
books.loc[books["yearOfPublication"] == "DK Publishing Inc"]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",2000,DK Publishing Inc,http://images.amazon.com/images/P/078946697X.0...
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",2000,DK Publishing Inc,http://images.amazon.com/images/P/0789466953.0...

In [16]:
books.loc[books["yearOfPublication"] == "Gallimard"]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-M...",2003,Gallimard,http://images.amazon.com/images/P/2070426769.0...

### Drop the rows having `'DK Publishing Inc'` and `'Gallimard'` as `yearOfPublication`

In [17]:
books.drop(books.loc[books['yearOfPublication']=="Gallimard"].index, inplace=True)

In [18]:
books.drop(books.loc[books['yearOfPublication']=="DK Publishing Inc"].index, inplace=True)

In [19]:
books.loc[books["yearOfPublication"] == "DK Publishing Inc"]

Empty DataFrame
Columns: [ISBN, bookTitle, bookAuthor, yearOfPublication, publisher]
Index: []

In [20]:
books.loc[books["yearOfPublication"] == "Gallimard"]

Empty DataFrame
Columns: [ISBN, bookTitle, bookAuthor, yearOfPublication, publisher]
Index: []

### Change the datatype of yearOfPublication to 'int'

In [21]:
books["yearOfPublication"] = books.yearOfPublication.astype('int64')

In [22]:
books.dtypes

ISBN                 object
bookTitle            object
bookAuthor           object
yearOfPublication     int64
publisher            object
dtype: object

### Drop NaNs in `'publisher'` column

In [23]:
books.dropna(subset=['publisher'],inplace=True)

In [24]:
books.isna().sum()

ISBN                 0
bookTitle            0
bookAuthor           1
yearOfPublication    0
publisher            0
dtype: int64

## Exploring Users dataset

In [25]:
print(users.shape)
users.head()

(691122, 3)

  userID                            Location   Age
0      1                  nyc, new york, usa   NaN
1      2           stockton, california, usa  18.0
2      3     moscow, yukon territory, russia   NaN
3      4           porto, v.n.gaia, portugal  17.0
4      5  farnborough, hants, united kingdom   NaN

### Get all unique values in ascending order for column `Age`

In [26]:
print(sorted(users['Age'].unique()))

[nan, 0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19.0, 20.0, 21.0, 22.0, 23.0, 24.0, 25.0, 26.0, 27.0, 28.0, 29.0, 30.0, 31.0, 32.0, 33.0, 34.0, 35.0, 36.0, 37.0, 38.0, 39.0, 40.0, 41.0, 42.0, 43.0, 44.0, 45.0, 46.0, 47.0, 48.0, 49.0, 50.0, 51.0, 52.0, 53.0, 54.0, 55.0, 56.0, 57.0, 58.0, 59.0, 60.0, 61.0, 62.0, 63.0, 64.0, 65.0, 66.0, 67.0, 68.0, 69.0, 70.0, 71.0, 72.0, 73.0, 74.0, 75.0, 76.0, 77.0, 78.0, 79.0, 80.0, 81.0, 82.0, 83.0, 84.0, 85.0, 86.0, 87.0, 88.0, 89.0, 90.0, 91.0, 92.0, 93.0, 94.0, 95.0, 96.0, 97.0, 98.0, 99.0, 100.0, 101.0, 102.0, 103.0, 104.0, 105.0, 106.0, 107.0, 108.0, 109.0, 110.0, 111.0, 113.0, 114.0, 115.0, 116.0, 118.0, 119.0, 123.0, 124.0, 127.0, 128.0, 132.0, 133.0, 136.0, 137.0, 138.0, 140.0, 141.0, 143.0, 146.0, 147.0, 148.0, 151.0, 152.0, 156.0, 157.0, 159.0, 162.0, 168.0, 172.0, 175.0, 183.0, 186.0, 189.0, 199.0, 200.0, 201.0, 204.0, 207.0, 208.0, 209.0, 210.0, 212.0, 219.0, 220.0, 223.0, 226.0, 228.0, 229.0, 230.0, 231.0, 237.0, 239.0, 244.0]

Age column has some invalid entries like nan, 0 and very high values like 100 and above

### Values below 5 and above 90 do not make much sense for our book rating case...hence replace these by NaNs

In [27]:
users.loc[users["Age"] < 5, "Age"] = np.nan
users.loc[users["Age"] > 90, "Age"] = np.nan

### Replace null values in column `Age` with mean

In [28]:
(users.Age < 5).sum()

0

In [29]:
(users.Age > 90).sum()

0

In [30]:
users['Age'] = users['Age'].fillna((users['Age'].mean()))

In [31]:
users.Age.isna().sum()

0

### Change the datatype of `Age` to `int`

In [32]:
users["Age"] = users.Age.astype('int64')

In [33]:
print(sorted(users.Age.unique()))

[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90]

## Exploring the Ratings Dataset

### check the shape

In [34]:
ratings.shape

(1149780, 3)

In [35]:
n_users = users.shape[0]
n_books = books.shape[0]

In [36]:
ratings.head(20)

    userID        ISBN  bookRating
0   276725  034545104X           0
1   276726  0155061224           5
2   276727  0446520802           0
3   276729  052165615X           3
4   276729  0521795028           6
5   276733  2080674722           0
6   276736  3257224281           8
7   276737  0600570967           6
8   276744  038550120X           7
9   276745   342310538          10
10  276746  0425115801           0
11  276746  0449006522           0
12  276746  0553561618           0
13  276746  055356451X           0
14  276746  0786013990           0
15  276746  0786014512           0
16  276747  0060517794           9
17  276747  0451192001           0
18  276747  0609801279           0
19  276747  0671537458           9

### Ratings dataset should have books only which exist in our books dataset. Drop the remaining rows

In [37]:
rb_cond = ratings[(~ratings['ISBN'].isin(books['ISBN']) == True)]

In [38]:
ratings.drop(rb_cond.index,inplace=True)

In [39]:
ratings.shape

(1031130, 3)

In [40]:
ratings.head()

   userID        ISBN  bookRating
0  276725  034545104X           0
1  276726  0155061224           5
2  276727  0446520802           0
3  276729  052165615X           3
4  276729  0521795028           6

### Ratings dataset should have ratings from users which exist in users dataset. Drop the remaining rows

In [42]:
ru_cond = ratings[(~ratings['userID'].isin(users['userID']) == True)]

In [43]:
ratings.drop(ru_cond.index, inplace = True)

In [45]:
ratings.shape

(971787, 3)

In [46]:
ratings.head()

      userID        ISBN  bookRating
9561       2  0195153448           0
9563       8  0002005018           5
9564       8  0060973129           0
9565       8  0374157065           0
9566       8  0393045218           0

### Consider only ratings from 1-10 and leave 0s in column `bookRating`

In [47]:
ratings["bookRating"].unique()

array([ 0,  5,  6,  7, 10,  9,  3,  8,  4,  2,  1], dtype=int64)

In [53]:
br_cond = ratings[~((ratings["bookRating"] > 0) & (ratings["bookRating"] < 11))]
ratings_br = ratings.drop(br_cond.index)

In [54]:
ratings_br["bookRating"].unique()

array([ 5,  6,  7, 10,  9,  3,  8,  4,  2,  1], dtype=int64)

### Find out which rating has been given highest number of times

In [57]:
ratings_br["bookRating"].value_counts().head(1)

8    86829
Name: bookRating, dtype: int64

### **Collaborative Filtering Based Recommendation Systems**

### For more accurate results only consider users who have rated atleast 100 books

In [61]:
Hundred_ru = (ratings_br.groupby(['userID']).agg({'ISBN': 'count'}).rename(columns={'ISBN': 'count'}))
Hr_Rating_users=Hundred_ru[Hundred_ru["count"]>100]
Hr_Rating_users.reset_index(inplace=True)

In [62]:
Hr_Rating_users.shape

(417, 2)

In [63]:
Hr_Rating_users.head()

   userID  count
0    2033    129
1    2110    103
2    2276    196
3    4017    154
4    4385    212

In [64]:
ratings_user_all =ratings_br.merge(Hr_Rating_users, how='inner', on=['userID']).drop(labels="count",axis=1)
ratings_user_all=ratings_user_all.merge(books, how='inner', on=['ISBN'])

In [65]:
ratings_user_all.shape

(98461, 7)

In [66]:
ratings_user_all.head()

,userID,ISBN,bookRating,bookTitle,bookAuthor,yearOfPublication,publisher
0,2033,0030020786,7,Principles of Instrumental Analysis,Douglas A. Skoog,1997,Brooks Cole
1,2033,0060248025,10,Falling Up,Shel Silverstein,1996,HarperCollins
2,8681,0060248025,9,Falling Up,Shel Silverstein,1996,HarperCollins
3,30735,0060248025,9,Falling Up,Shel Silverstein,1996,HarperCollins
4,36606,0060248025,10,Falling Up,Shel Silverstein,1996,HarperCollins

### Generating ratings matrix from explicit ratings

#### Note: since NaNs cannot be handled by training algorithms, replace these by 0, which indicates absence of ratings

In [67]:
ratings_user_all.isna().sum()

userID               0
ISBN                 0
bookRating           0
bookTitle            0
bookAuthor           0
yearOfPublication    0
publisher            0
dtype: int64

In [68]:
# Consider only those books present in the ratings_user_all
books_in_rua =books[books['ISBN'].isin(ratings_user_all['ISBN'])==True]

In [69]:
# Rating user matrix
ratings_user_matrix = ratings_user_all.pivot(index = 'userID', columns ='ISBN', values = 'bookRating').fillna(0)
ratings_user_matrix.head()

ISBN,0000913154,0001046438,000104687X,0001047213,0001047973,000104799X,0001048082,0001053736,0001053744,0001055607,...,B000092Q0A,B00009EF82,B00009NDAN,B0000DYXID,B0000T6KHI,B0000VZEJQ,B0000X8HIE,B00013AX9E,B0001I1KOG,B000234N3A
userID,,,,,,,,,,,,,,,,,,,,,
2033,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2110,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2276,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4017,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4385,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [70]:
ratings_user_matrix.shape

(417, 64431)

### Generate the predicted ratings using SVD with no.of singular values to be 50

In [71]:
from scipy.sparse.linalg import svds
U, sigma, Vt = svds(ratings_user_matrix, k = 50)
sigma = np.diag(sigma)

In [72]:
Pred_ratings_all = np.dot(np.dot(U, sigma), Vt) 
Pred_all = pd.DataFrame(Pred_ratings_all, columns = ratings_user_matrix.columns)

In [73]:
pd.DataFrame(Pred_ratings_all).shape

(417, 64431)

### Take a particular user_id

### Lets find the recommendations for user with id `2110`

#### Note: Execute the below cells to get the variables loaded

In [75]:
userID = 2110

In [76]:
user_id = 2 #2nd row in ratings matrix and predicted matrix

### Get the predicted ratings for userID `2110` and sort them in descending order

In [77]:
sort_user_pred=Pred_all.iloc[user_id].sort_values(ascending=False)
sort_user_pred.head()

ISBN
0316666343    1.010792
059035342X    0.831442
044021145X    0.697181
0440214041    0.693957
0385504209    0.672437
Name: 2, dtype: float64

### Create a dataframe with name `user_data` containing userID `2110` explicitly interacted books

In [78]:
user_data=ratings_user_all[ratings_user_all["userID"]==2110].drop(labels=["bookTitle","bookAuthor","yearOfPublication","publisher"],axis=1)

In [79]:
user_data.head()

     userID        ISBN  bookRating
536    2110  0060987529           7
553    2110  0064472779           8
555    2110  0140022651          10
556    2110  0142302163           8
557    2110  0151008116           5

In [80]:
user_data.shape

(103, 3)

### Combine the user_data and and corresponding book data(`book_data`) in a single dataframe with name `user_full_info`

In [81]:
book_data=books.merge(user_data, how='inner', on=['ISBN']).drop(labels=["userID","bookRating"],axis=1)

In [82]:
book_data.shape

(103, 5)

In [83]:
book_data.head()

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0151008116,Life of Pi,Yann Martel,2002,Harcourt
1,015216250X,So You Want to Be a Wizard: The First Book in ...,Diane Duane,2001,Magic Carpet Books
2,0064472779,All-American Girl,Meg Cabot,2003,HarperTrophy
3,0345307674,Return of the Jedi (Star Wars),James Kahn,1983,Del Rey Books
4,0671527215,Hitchhikers's Guide to the Galaxy,Douglas Adams,1984,Pocket

In [84]:
user_full_info=pd.merge(user_data,book_data,how='inner',on='ISBN')

In [85]:
user_full_info.head()

,userID,ISBN,bookRating,bookTitle,bookAuthor,yearOfPublication,publisher
0,2110,0060987529,7,Confessions of an Ugly Stepsister : A Novel,Gregory Maguire,2000,Regan Books
1,2110,0064472779,8,All-American Girl,Meg Cabot,2003,HarperTrophy
2,2110,0140022651,10,Journey to the Center of the Earth,Jules Verne,1965,Penguin Books
3,2110,0142302163,8,The Ghost Sitter,Peni R. Griffin,2002,Puffin Books
4,2110,0151008116,5,Life of Pi,Yann Martel,2002,Harcourt

### Get top 10 recommendations for above given userID from the books not already rated by that user

In [86]:
recommendations = books_in_rua[~books_in_rua['ISBN'].isin(user_full_info['ISBN'])].merge(pd.DataFrame(sort_user_pred).reset_index(), how = 'left', left_on = 'ISBN', right_on = 'ISBN').rename(columns = {2: 'Predictions'})

In [87]:
recommendations.sort_values('Predictions', ascending = False).iloc[0:10,:]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher,Predictions
236,0316666343,The Lovely Bones: A Novel,Alice Sebold,2002,"Little, Brown",1.010792
250,044021145X,The Firm,John Grisham,1992,Bantam Dell Publishing Group,0.697181
1307,0440214041,The Pelican Brief,John Grisham,1993,Dell,0.693957
420,0385504209,The Da Vinci Code,Dan Brown,2003,Doubleday,0.672437
2522,0345313151,Bearing an Hourglass (Incarnations of Immortal...,Piers Anthony,1991,Del Rey Books,0.660623
1628,0312966970,Four To Score (A Stephanie Plum Novel),Janet Evanovich,1999,St. Martin's Paperbacks,0.660521
1149,0345350499,The Mists of Avalon,MARION ZIMMER BRADLEY,1987,Del Rey,0.657418
3253,0380752891,"Man from Mundania (Xanth Trilogy, No 12)",Piers Anthony,1990,Harper Mass Market Paperbacks,0.651178
9905,0345318862,Golem in the Gears (Xanth Novels (Paperback)),PIERS ANTHONY,1986,Del Rey,0.648278
15,0446310786,To Kill a Mockingbird,Harper Lee,1988,Little Brown &amp; Company,0.628193

In [88]:
# Test to see if any of the recommendations given already exist for the user 2110. Result should be false
ratings_br[ratings_br["userID"]==2110].ISBN.isin(recommendations['ISBN']).unique()

array([False])